In [ ]:
people = {
    "FirstName" : ['Stefan', 'Aria', 'Marvin'],
    "LastName" : ['Raats', 'Jadhav', 'Martens'],
    "Cls" : ['Intern', 'Intern', 'Superv']
                  
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

  FirstName LastName     Cls
0    Stefan    Raats  Intern
1      Aria   Jadhav  Intern
2    Marvin  Martens  Superv

In [5]:
df.columns

Index(['FirstName', 'LastName', 'Cls'], dtype='object')

HOW TO UPDATE COLUMNS

In [6]:
df.columns = ['FirstName', 'LastName', 'Type']
df

  FirstName LastName    Type
0    Stefan    Raats  Intern
1      Aria   Jadhav  Intern
2    Marvin  Martens  Superv

lets say everything is uppercase and you don't want that. Or it uses spaces and you want ____. Or you only want to change a specific column

In [7]:
df.columns = [x.upper() for x in df.columns]
df

  FIRSTNAME LASTNAME    TYPE
0    Stefan    Raats  Intern
1      Aria   Jadhav  Intern
2    Marvin  Martens  Superv

In [8]:
df.columns = df.columns.str.replace('E', '_')
df

  FIRSTNAM_ LASTNAM_    TYP_
0    Stefan    Raats  Intern
1      Aria   Jadhav  Intern
2    Marvin  Martens  Superv

In [9]:
df.columns = df.columns.str.replace('_', 'E')
df.columns = [x.lower() for x in df.columns]

In [10]:
df.rename(columns={'firstname' : 'first', "lastname": 'last'}, inplace=True)
df

    first     last    type
0  Stefan    Raats  Intern
1    Aria   Jadhav  Intern
2  Marvin  Martens  Superv

Now how to update rows (can also use conditional selection)

In [11]:
df.loc[0] = ['Stefan', 'R', 'Intern']
df

    first     last    type
0  Stefan        R  Intern
1    Aria   Jadhav  Intern
2  Marvin  Martens  Superv

use .at do not use .loc if you are changing a single value

In [12]:
df.at[0, 'last'] = 'Raats'
df

    first     last    type
0  Stefan    Raats  Intern
1    Aria   Jadhav  Intern
2  Marvin  Martens  Superv

Following is usefull if you for example want the name of a gene which has logfc above x or something

In [13]:
filt = (df['type'] == 'Superv')
df[filt]['last']

2    Martens
Name: last, dtype: object

In [14]:
df['type'] = df['type'].str.lower()
df

    first     last    type
0  Stefan    Raats  intern
1    Aria   Jadhav  intern
2  Marvin  Martens  superv

Lets say i want the lenght of characters of a column

In [15]:
df['last'].apply(len)

0    5
1    6
2    7
Name: last, dtype: int64

In [16]:
def last_upper(last):
    return last.upper()

In [17]:
df['last'] = df['last'].apply(last_upper)
df

    first     last    type
0  Stefan    RAATS  intern
1    Aria   JADHAV  intern
2  Marvin  MARTENS  superv

Apply function without defining it first. So an anonymous function. Can use this for numbers too! run calc

In [18]:
df['last'] = df['last'].apply(lambda x: x.lower())
df

    first     last    type
0  Stefan    raats  intern
1    Aria   jadhav  intern
2  Marvin  martens  superv

row is standard for len

In [19]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [20]:
len(df['last'])

3

gives alphabetical order first one for every column. This is more usefull for num data.

In [21]:
df.apply(pd.Series.min)

first      Aria
last     jadhav
type     intern
dtype: object

In [22]:
df.applymap(len)

   first  last  type
0      6     5     6
1      4     6     6
2      6     7     6

In [23]:
df['type'].replace({'intern': 'aop', 'superv': 'phd'}) #use .map for changing everything and what does not match will be NaN

0    aop
1    aop
2    phd
Name: type, dtype: object

In [24]:
df['type'].replace({'aop': 'inter', 'phd': 'superv'}) #use .map for changing everything and what does not match will be NaN

0    intern
1    intern
2    superv
Name: type, dtype: object

In [25]:
df['first'] + " " + df['last']

0      Stefan raats
1       Aria jadhav
2    Marvin martens
dtype: object

In [26]:
df['full_name'] = df['first'] + " " + df['last']

In [27]:
df

    first     last    type       full_name
0  Stefan    raats  intern    Stefan raats
1    Aria   jadhav  intern     Aria jadhav
2  Marvin  martens  superv  Marvin martens

In [28]:
df.drop(columns = ['first', 'last'], inplace=True)
df

     type       full_name
0  intern    Stefan raats
1  intern     Aria jadhav
2  superv  Marvin martens

In [29]:
df['full_name'].str.split(' ', expand=True)

        0        1
0  Stefan    raats
1    Aria   jadhav
2  Marvin  martens

In [30]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [31]:
df

     type       full_name   first     last
0  intern    Stefan raats  Stefan    raats
1  intern     Aria jadhav    Aria   jadhav
2  superv  Marvin martens  Marvin  martens

In [32]:
df.append({'first': 'Fransziska'}, ignore_index=True)

     type       full_name       first     last
0  intern    Stefan raats      Stefan    raats
1  intern     Aria jadhav        Aria   jadhav
2  superv  Marvin martens      Marvin  martens
3     NaN             NaN  Fransziska      NaN

add rows

In [33]:
people2 = {
    "first" : ['Peter', 'Bilbo'],
    "last" : ['Parker', 'Baggings'],
    "type" : ['Hero', 'Hobbit']
                  
}

In [34]:
df2 = pd.DataFrame(people2)

In [35]:
df = df.append(df2, ignore_index=True, sort=False)
df

     type       full_name   first      last
0  intern    Stefan raats  Stefan     raats
1  intern     Aria jadhav    Aria    jadhav
2  superv  Marvin martens  Marvin   martens
3    Hero             NaN   Peter    Parker
4  Hobbit             NaN   Bilbo  Baggings

In [36]:
df.drop(index=4)

     type       full_name   first     last
0  intern    Stefan raats  Stefan    raats
1  intern     Aria jadhav    Aria   jadhav
2  superv  Marvin martens  Marvin  martens
3    Hero             NaN   Peter   Parker

In [37]:
filtHero = df['type'] == 'Hero'
df.drop(index=df[filtHero].index)

     type       full_name   first      last
0  intern    Stefan raats  Stefan     raats
1  intern     Aria jadhav    Aria    jadhav
2  superv  Marvin martens  Marvin   martens
4  Hobbit             NaN   Bilbo  Baggings

Now lets get into sorting

In [38]:
df.sort_values(by='last', ascending=False)

     type       full_name   first      last
0  intern    Stefan raats  Stefan     raats
2  superv  Marvin martens  Marvin   martens
1  intern     Aria jadhav    Aria    jadhav
3    Hero             NaN   Peter    Parker
4  Hobbit             NaN   Bilbo  Baggings

In [39]:
df.sort_values(by=['type', 'last'], ascending=[True, False]) #df.sort_index is also an option

     type       full_name   first      last
3    Hero             NaN   Peter    Parker
4  Hobbit             NaN   Bilbo  Baggings
0  intern    Stefan raats  Stefan     raats
1  intern     Aria jadhav    Aria    jadhav
2  superv  Marvin martens  Marvin   martens

In [40]:
df['last'].sort_values

<bound method Series.sort_values of 0       raats
1      jadhav
2     martens
3      Parker
4    Baggings
Name: last, dtype: object>

Now how to remove missing values

In [41]:
import numpy as np
people = {
    "FirstName" : ['Stefan', 'Aria', 'Marvin', 'Peter', 'Bilbo', 'NA'],
    "LastName" : ['Raats', 'Jadhav', 'Martens', 'Parker', 'Baggings', 'NA'],
    "Type" : ['Intern', 'Intern', 'Superv', np.nan, 'Hero', 'Missing'],
    "Age" : ['20', '20', None, 'Missing', '111', 'Missing']
                  
}
df = pd.DataFrame(people)
df

  FirstName  LastName     Type      Age
0    Stefan     Raats   Intern       20
1      Aria    Jadhav   Intern       20
2    Marvin   Martens   Superv     None
3     Peter    Parker      NaN  Missing
4     Bilbo  Baggings     Hero      111
5        NA        NA  Missing  Missing

In [42]:
df.dropna()

  FirstName  LastName     Type      Age
0    Stefan     Raats   Intern       20
1      Aria    Jadhav   Intern       20
4     Bilbo  Baggings     Hero      111
5        NA        NA  Missing  Missing

In [43]:
df.dropna(axis='index', how='any', subset=['Age'])

  FirstName  LastName     Type      Age
0    Stefan     Raats   Intern       20
1      Aria    Jadhav   Intern       20
3     Peter    Parker      NaN  Missing
4     Bilbo  Baggings     Hero      111
5        NA        NA  Missing  Missing

Lets say i either need age or type but not both for my analysis.

In [44]:
df.dropna(axis='index', how='all', subset=['Age', 'Type'])

  FirstName  LastName     Type      Age
0    Stefan     Raats   Intern       20
1      Aria    Jadhav   Intern       20
2    Marvin   Martens   Superv     None
3     Peter    Parker      NaN  Missing
4     Bilbo  Baggings     Hero      111
5        NA        NA  Missing  Missing

In [45]:
df = pd.DataFrame(people)
df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)
df

  FirstName  LastName    Type   Age
0    Stefan     Raats  Intern    20
1      Aria    Jadhav  Intern    20
2    Marvin   Martens  Superv  None
3     Peter    Parker     NaN   NaN
4     Bilbo  Baggings    Hero   111
5       NaN       NaN     NaN   NaN

In [46]:
df.isna()

   FirstName  LastName   Type    Age
0      False     False  False  False
1      False     False  False  False
2      False     False  False   True
3      False     False   True   True
4      False     False  False  False
5       True      True   True   True

In [47]:
df.fillna('MISSING')

  FirstName  LastName     Type      Age
0    Stefan     Raats   Intern       20
1      Aria    Jadhav   Intern       20
2    Marvin   Martens   Superv  MISSING
3     Peter    Parker  MISSING  MISSING
4     Bilbo  Baggings     Hero      111
5   MISSING   MISSING  MISSING  MISSING

In [48]:
df.dtypes

FirstName    object
LastName     object
Type         object
Age          object
dtype: object

In [49]:
type(np.nan)

float

In [50]:
df['Age'] = df['Age'].astype(float)

In [51]:
df['Age'].mean()

50.333333333333336

finished